'''
异或运算法属于一种逻辑运算，
运算时要求把参与运算的数转换为二进制数再进行按位运算。
两个值不相同,那么异或结果为1。如果两个值相同,那么异或结果为0。

例如：对于任意一个字符,都可以用二进制编码形式来表示,
字符的异或运算就是对每位进行运算。例如,字符串“Hello”
(8位ASCII表示: 01001000 01100101 01101100 01101100 01101111)
可以按如下的方式用密钥10110001
进行加密:
01001000 01100101 01101100 01101100 01101111(P 明文)
10110001 10110001 10110001 10110001 10110001(K-密钥)
11111001 11010100 11011101 11011101 11011110(C-密文)
'''
def zh(zifu):
    mw=''
    for i in zh:
        a=ord(i);


def encrypt(code,key):
    code_new=""
    x=len(code)
    for i in range(x):
        if code[i]==key[i]:
            code_new+="0"
        else:
            code_new+="1"
        
    return code_new
code= input("请输入加密字符串：")
key=input("请输入密钥字符串：")
print(encrypt(code,key))
